package com.example.task3_aston_recycler

import com.example.task3_aston_recycler.Utilities.ContactAdapter

object ContactRepository {

    private val contactsList = mutableListOf<Contact>()
    private var contactAdapter: ContactAdapter? = null

    fun initAdapter(adapter: ContactAdapter) {
        contactAdapter = adapter
    }


    private fun notifyAdapterDataSetChanged() {
        contactAdapter?.submitList(contactsList.toList())
    }

    fun getContacts(): List<Contact> {
        return contactsList
    }

    fun addContact(firstName: String, lastName: String, phoneNumber: String) {
        val newId = System.currentTimeMillis().toInt()
        val newContact = Contact(newId, firstName, lastName, phoneNumber)

        contactsList.add(newContact)
        notifyAdapterDataSetChanged()
    }

    fun getContactById(contactId: Int): Contact? {
        return contactsList.find { it.id == contactId }
    }

    fun updateContact(contactId: Int, firstName: String, lastName: String, phoneNumber: String) {
        val existingContact = contactsList.find { it.id == contactId }

        if (existingContact != null) {
            existingContact.firstName = firstName
            existingContact.lastName = lastName
            existingContact.phoneNumber = phoneNumber
        }
    }

    fun contactsList() {
        contactsList.addAll(
            listOf(
                Contact(1, "Иван", "Иванов", "+7-901-123-45-67"),
                Contact(2, "Мария", "Петрова", "+7-902-234-56-78"),
                Contact(3, "Александр", "Сидоров", "+7-903-345-67-89"),
                Contact(4, "Екатерина", "Кузнецова", "+7-904-456-78-90"),
                Contact(5, "Дмитрий", "Смирнов", "+7-905-567-89-01"),
                Contact(6, "Ольга", "Соколова", "+7-906-678-90-12"),
                Contact(7, "Андрей", "Попов", "+7-907-789-01-23"),
                Contact(8, "Наталья", "Лебедева", "+7-908-890-12-34"),
                Contact(9, "Алексей", "Козлов", "+7-909-901-23-45"),
                Contact(10, "Михаил", "Новиков", "+7-910-012-34-56"),
                Contact(11, "Ирина", "Морозова", "+7-911-123-45-67"),
                Contact(12, "Сергей", "Зайцев", "+7-912-234-56-78"),
                Contact(13, "Виктория", "Васильева", "+7-913-345-67-89"),
                Contact(14, "Владимир", "Жуков", "+7-914-456-78-90"),
                Contact(15, "Анна", "Ершова", "+7-915-567-89-01"),
                Contact(16, "Павел", "Соловьев", "+7-916-678-90-12"),
                Contact(17, "Николай", "Семенов", "+7-917-789-01-23"),
                Contact(18, "Евгений", "Герасимов", "+7-918-890-12-34"),
                Contact(19, "Татьяна", "Пономарева", "+7-919-901-23-45"),
                Contact(20, "Юрий", "Романов", "+7-920-012-34-56"),
                Contact(21, "Олег", "Федоров", "+7-921-123-45-67"),
                Contact(22, "Галина", "Давыдова", "+7-922-234-56-78"),
                Contact(23, "Василий", "Орлов", "+7-923-345-67-89"),
                Contact(24, "Людмила", "Андреева", "+7-924-456-78-90"),
                Contact(25, "Игорь", "Максимов", "+7-925-567-89-01"),
                Contact(26, "Надежда", "Захарова", "+7-926-678-90-12"),
                Contact(27, "Семён", "Борисов", "+7-927-789-01-23"),
                Contact(28, "Антон", "Куликов", "+7-928-890-12-34"),
                Contact(29, "Марина", "Ефимова", "+7-929-901-23-45"),
                Contact(30, "Роман", "Михайлов", "+7-930-012-34-56"),
                Contact(31, "Ксения", "Киселева", "+7-931-123-45-67"),
                Contact(32, "Максим", "Николаев", "+7-932-234-56-78"),
                Contact(33, "Юлия", "Виноградова", "+7-933-345-67-89"),
                Contact(34, "Артём", "Волков", "+7-934-456-78-90"),
                Contact(35, "Оксана", "Денисова", "+7-935-567-89-01"),
                Contact(36, "Тимур", "Медведев", "+7-936-678-90-12"),
                Contact(37, "Руслан", "Воробьев", "+7-937-789-01-23"),
                Contact(38, "Кристина", "Белова", "+7-938-890-12-34"),
                Contact(39, "Фёдор", "Соколов", "+7-939-901-23-45"),
                Contact(40, "Эльвира", "Фадеева", "+7-940-012-34-56"),
                Contact(41, "Виталий", "Лазарев", "+7-941-123-45-67"),
                Contact(42, "Злата", "Корнилова", "+7-942-234-56-78"),
                Contact(43, "Роман", "Гусев", "+7-943-345-67-89"),
                Contact(44, "Алина", "Титова", "+7-944-456-78-90"),
                Contact(45, "Ринат", "Кузьмин", "+7-945-567-89-01"),
                Contact(46, "Софья", "Евдокимова", "+7-946-678-90-12"),
                Contact(47, "Эдуард", "Гаврилов", "+7-947-789-01-23"),
                Contact(48, "Лилия", "Макеева", "+7-948-890-12-34"),
                Contact(49, "Радмир", "Федосеев", "+7-949-901-23-45"),
                Contact(50, "Ника", "Кудрявцева", "+7-950-012-34-56"),
                Contact(51, "Амир", "Баранов", "+7-951-123-45-67"),
                Contact(52, "Лариса", "Кулагина", "+7-952-234-56-78"),
                Contact(53, "Руслан", "Князев", "+7-953-345-67-89"),
                Contact(54, "Эвелина", "Бирюкова", "+7-954-456-78-90"),
                Contact(55, "Алан", "Соболев", "+7-955-567-89-01"),
                Contact(56, "Карина", "Абрамова", "+7-956-678-90-12"),
                Contact(57, "Мурат", "Кулаков", "+7-957-789-01-23"),
                Contact(58, "Жанна", "Савина", "+7-958-890-12-34"),
                Contact(59, "Ренат", "Рыбаков", "+7-959-901-23-45"),
                Contact(60, "Сабина", "Куликова", "+7-960-012-34-56"),
                Contact(61, "Шамиль", "Рогов", "+7-961-123-45-67"),
                Contact(62, "Фаина", "Третьякова", "+7-962-234-56-78"),
                Contact(63, "Рустам", "Одинцов", "+7-963-345-67-89"),
                Contact(64, "Клавдия", "Суворова", "+7-964-456-78-90"),
                Contact(65, "Рушан", "Назаров", "+7-965-567-89-01"),
                Contact(66, "Анфиса", "Никулина", "+7-966-678-90-12"),
                Contact(67, "Батыр", "Ефремов", "+7-967-789-01-23"),
                Contact(68, "Диана", "Селезнева", "+7-968-890-12-34"),
                Contact(69, "Ринат", "Чернов", "+7-969-901-23-45"),
                Contact(70, "Снежана", "Игнатова", "+7-969-901-23-45"),
                Contact(71, "Руслан", "Комаров", "+7-971-123-45-67"),
                Contact(72, "Анжелика", "Фролова", "+7-972-234-56-78"),
                Contact(73, "Дамир", "Шарапов", "+7-973-345-67-89"),
                Contact(74, "Нелли", "Климова", "+7-974-456-78-90"),
                Contact(75, "Рустем", "Морозов", "+7-975-567-89-01"),
                Contact(76, "Мелания", "Фомина", "+7-976-678-90-12"),
                Contact(77, "Искандер", "Блохин", "+7-977-789-01-23"),
                Contact(78, "Лиана", "Назаренко", "+7-978-890-12-34"),
                Contact(79, "Тимофей", "Николаев", "+7-979-901-23-45"),
                Contact(80, "Яна", "Орехова", "+7-980-012-34-56"),
                Contact(81, "Ибрагим", "Кузин", "+7-981-123-45-67"),
                Contact(82, "Милена", "Никитина", "+7-982-234-56-78"),
                Contact(83, "Денис", "Овчинников", "+7-983-345-67-89"),
                Contact(84, "Ася", "Соболева", "+7-984-456-78-90"),
                Contact(85, "Эдуард", "Доронин", "+7-985-567-89-01"),
                Contact(86, "Лариса", "Бирюкова", "+7-986-678-90-12"),
                Contact(87, "Альберт", "Федотов", "+7-987-789-01-23"),
                Contact(88, "Алиса", "Кудряшова", "+7-988-890-12-34"),
                Contact(89, "Айдар", "Беляев", "+7-989-901-23-45"),
                Contact(90, "Таисия", "Самойлова", "+7-990-012-34-56"),
                Contact(91, "Азамат", "Миронов", "+7-991-123-45-67"),
                Contact(92, "Вероника", "Орехова", "+7-992-234-56-78"),
                Contact(93, "Ильяс", "Бирюков", "+7-993-345-67-89"),
                Contact(94, "Лада", "Савченко", "+7-994-456-78-90"),
                Contact(95, "Руслан", "Сухов", "+7-995-567-89-01"),
                Contact(96, "Таиса", "Веселова", "+7-996-678-90-12"),
                Contact(97, "Айрат", "Куликов", "+7-997-789-01-23"),
                Contact(98, "Диана", "Орлова", "+7-998-890-12-34"),
                Contact(99, "Дамир", "Игнатов", "+7-999-901-23-45"),
                Contact(100, "Анна", "Лазарева", "+7-900-012-34-56")
            )
        )
    }
}